<details><summary>tf plan:</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # pagerduty_escalation_policy.service_a[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_escalation_policy" "service_a" {
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Managed by Terraform"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "Service A"
      [32m+[0m [0m[1m[0mnum_loops[0m[0m   = 9

      [32m+[0m [0mrule {
          [32m+[0m [0m[1m[0mescalation_delay_in_minutes[0m[0m = 30
          [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)

          [32m+[0m [0mtarget {
              [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m = "schedule_reference"
            }
        }
    }

[1m  # pagerduty_escalation_policy.service_b[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_escalation_policy" "service_b" {
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Managed by Terraform"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "Service B"
      [32m+[0m [0m[1m[0mnum_loops[0m[0m   = 9

      [32m+[0m [0mrule {
          [32m+[0m [0m[1m[0mescalation_delay_in_minutes[0m[0m = 30
          [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)

          [32m+[0m [0mtarget {
              [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m = "schedule_reference"
            }
        }
    }

[1m  # pagerduty_schedule.schedule_service_a[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_schedule" "schedule_service_a" {
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Managed by Terraform"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "Service A"
      [32m+[0m [0m[1m[0mtime_zone[0m[0m   = "Europe/London"

      [32m+[0m [0mlayer {
          [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                         = "Service A"
          [32m+[0m [0m[1m[0mrotation_turn_length_seconds[0m[0m = 604800
          [32m+[0m [0m[1m[0mrotation_virtual_start[0m[0m       = "2020-06-08T08:00:00-00:00"
          [32m+[0m [0m[1m[0mstart[0m[0m                        = "2020-06-08T08:00:00-00:00"
          [32m+[0m [0m[1m[0musers[0m[0m                        = (known after apply)
        }
    }

[1m  # pagerduty_schedule.schedule_service_b[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_schedule" "schedule_service_b" {
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Managed by Terraform"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "Service B"
      [32m+[0m [0m[1m[0mtime_zone[0m[0m   = "Europe/London"

      [32m+[0m [0mlayer {
          [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                         = "Service B"
          [32m+[0m [0m[1m[0mrotation_turn_length_seconds[0m[0m = 604800
          [32m+[0m [0m[1m[0mrotation_virtual_start[0m[0m       = "2020-06-08T08:00:00-00:00"
          [32m+[0m [0m[1m[0mstart[0m[0m                        = "2020-06-08T08:00:00-00:00"
          [32m+[0m [0m[1m[0musers[0m[0m                        = (known after apply)
        }
    }

[1m  # pagerduty_service.alertmanager_service_a[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_service" "alertmanager_service_a" {
      [32m+[0m [0m[1m[0macknowledgement_timeout[0m[0m = "1800"
      [32m+[0m [0m[1m[0malert_creation[0m[0m          = "create_incidents"
      [32m+[0m [0m[1m[0mauto_resolve_timeout[0m[0m    = "14400"
      [32m+[0m [0m[1m[0mcreated_at[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m             = "Managed by Terraform"
      [32m+[0m [0m[1m[0mescalation_policy[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mhtml_url[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mlast_incident_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                    = "Alertmanager Service A"
      [32m+[0m [0m[1m[0mstatus[0m[0m                  = (known after apply)

      [32m+[0m [0mincident_urgency_rule {
          [32m+[0m [0m[1m[0mtype[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0murgency[0m[0m = (known after apply)

          [32m+[0m [0mduring_support_hours {
              [32m+[0m [0m[1m[0mtype[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0murgency[0m[0m = (known after apply)
            }

          [32m+[0m [0moutside_support_hours {
              [32m+[0m [0m[1m[0mtype[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0murgency[0m[0m = (known after apply)
            }
        }
    }

[1m  # pagerduty_service.alertmanager_service_b[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_service" "alertmanager_service_b" {
      [32m+[0m [0m[1m[0macknowledgement_timeout[0m[0m = "1800"
      [32m+[0m [0m[1m[0malert_creation[0m[0m          = "create_incidents"
      [32m+[0m [0m[1m[0mauto_resolve_timeout[0m[0m    = "14400"
      [32m+[0m [0m[1m[0mcreated_at[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m             = "Managed by Terraform"
      [32m+[0m [0m[1m[0mescalation_policy[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mhtml_url[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mlast_incident_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                    = "Alertmanager Service B"
      [32m+[0m [0m[1m[0mstatus[0m[0m                  = (known after apply)

      [32m+[0m [0mincident_urgency_rule {
          [32m+[0m [0m[1m[0mtype[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0murgency[0m[0m = (known after apply)

          [32m+[0m [0mduring_support_hours {
              [32m+[0m [0m[1m[0mtype[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0murgency[0m[0m = (known after apply)
            }

          [32m+[0m [0moutside_support_hours {
              [32m+[0m [0m[1m[0mtype[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0murgency[0m[0m = (known after apply)
            }
        }
    }

[1m  # pagerduty_service_integration.integration_service_a[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_service_integration" "integration_service_a" {
      [32m+[0m [0m[1m[0mhtml_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mintegration_email[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mintegration_key[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m              = "Alertmanager Service A integration"
      [32m+[0m [0m[1m[0mservice[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m              = "generic_events_api_inbound_integration"
      [32m+[0m [0m[1m[0mvendor[0m[0m            = (known after apply)
    }

[1m  # pagerduty_service_integration.integration_service_b[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_service_integration" "integration_service_b" {
      [32m+[0m [0m[1m[0mhtml_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mintegration_email[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mintegration_key[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m              = "Alertmanager Service B integration"
      [32m+[0m [0m[1m[0mservice[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m              = "generic_events_api_inbound_integration"
      [32m+[0m [0m[1m[0mvendor[0m[0m            = (known after apply)
    }

[1m  # pagerduty_user.user["alice"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_user" "user" {
      [32m+[0m [0m[1m[0mavatar_url[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mcolor[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m     = "Managed by Terraform"
      [32m+[0m [0m[1m[0memail[0m[0m           = "alice@email.com"
      [32m+[0m [0m[1m[0mhtml_url[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0minvitation_sent[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "Alice"
      [32m+[0m [0m[1m[0mrole[0m[0m            = "user"
      [32m+[0m [0m[1m[0mteams[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtime_zone[0m[0m       = (known after apply)
    }

[1m  # pagerduty_user.user["bob"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_user" "user" {
      [32m+[0m [0m[1m[0mavatar_url[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mcolor[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m     = "Managed by Terraform"
      [32m+[0m [0m[1m[0memail[0m[0m           = "bob@email.com"
      [32m+[0m [0m[1m[0mhtml_url[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0minvitation_sent[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "Bob"
      [32m+[0m [0m[1m[0mrole[0m[0m            = "user"
      [32m+[0m [0m[1m[0mteams[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtime_zone[0m[0m       = (known after apply)
    }

[1m  # pagerduty_user.user["mary"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "pagerduty_user" "user" {
      [32m+[0m [0m[1m[0mavatar_url[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mcolor[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m     = "Managed by Terraform"
      [32m+[0m [0m[1m[0memail[0m[0m           = "mary@email.com"
      [32m+[0m [0m[1m[0mhtml_url[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0minvitation_sent[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "Mary"
      [32m+[0m [0m[1m[0mrole[0m[0m            = "admin"
      [32m+[0m [0m[1m[0mteams[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mtime_zone[0m[0m       = (known after apply)
    }

[0m[1mPlan:[0m 11 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>